MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG064/mcu.h
#define _USBFIFO7_DATA_POSITION                  0x00000000
#define _USBFIFO7_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO7_DATA_LENGTH                    0x00000020

#define _USBOTG_SESSION_POSITION                 0x00000000
#define _USBOTG_SESSION_MASK                     0x00000001
#define _USBOTG_SESSION_LENGTH                   0x00000001

#define _USBOTG_HOSTREQ_POSITION                 0x00000001
#define _USBOTG_HOSTREQ_MASK                     0x00000002
#define _USBOTG_HOSTREQ_LENGTH                   0x00000001

#define _USBOTG_HOSTMODE_POSITION                0x00000002
#define _USBOTG_HOSTMODE_MASK                    0x00000004
#define _USBOTG_HOSTMODE_LENGTH                  0x00000001

#define _USBOTG_VBUS_POSITION                    0x00000003
#define _USBOTG_VBUS_MASK                        0x00000018
#define _USBOTG_VBUS_LENGTH                      0x00000002

#define _USBOTG_LSDEV_POSITION                   0x00000005
#define _USBOTG_LSDEV_MASK                       0x00000020
#define _USBOTG_LSDEV_LENGTH                     0x00000001

#define _USBOTG_FSDEV_POSITION                   0x00000006
#define _USBOTG_FSDEV_MASK                       0x00000040
#define _USBOTG_FSDEV_LENGTH                     0x00000001

#define _USBOTG_BDEV_POSITION                    0x00000007
#define _USBOTG_BDEV_MASK                        0x00000080
#define _USBOTG_BDEV_LENGTH                      0x00000001

#define _USBOTG_RXEDMA_POSITION                  0x00000008
#define _USBOTG_RXEDMA_MASK                      0x00000100
#define _USBOTG_RXEDMA_LENGTH                    0x00000001

#define _USBOTG_TXEDMA_POSITION                  0x00000009
#define _USBOTG_TXEDMA_MASK                      0x00000200
#define _USBOTG_TXEDMA_LENGTH                    0x00000001

#define _USBOTG_TXFIFOSZ_POSITION                0x00000010
#define _USBOTG_TXFIFOSZ_MASK                    0x000F0000
#define _USBOTG_TXFIFOSZ_LENGTH                  0x00000004

#define _USBOTG_TXDPB_POSITION                   0x00000014
#define _USBOTG_TXDPB_MASK                       0x00100000
#define _USBOTG_TXDPB_LENGTH                     0x00000001

#define _USBOTG_RXFIFOSZ_POSITION                0x00000018
#define _USBOTG_RXFIFOSZ_MASK                    0x0F000000
#define _USBOTG_RXFIFOSZ_LENGTH                  0x00000004

#define _USBOTG_RXDPB_POSITION                   0x0000001C
#define _USBOTG_RXDPB_MASK                       0x10000000
#define _USBOTG_RXDPB_LENGTH                     0x00000001

#define _USBFIFOA_TXFIFOAD_POSITION              0x00000000
#define _USBFIFOA_TXFIFOAD_MASK                  0x00001FFF
#define _USBFIFOA_TXFIFOAD_LENGTH                0x0000000D

#define _USBFIFOA_RXFIFOAD_POSITION              0x00000010
#define _USBFIFOA_RXFIFOAD_MASK                  0x1FFF0000
#define _USBFIFOA_RXFIFOAD_LENGTH                0x0000000D

#define _USBHWVER_VERMINOR_POSITION              0x00000000
#define _USBHWVER_VERMINOR_MASK                  0x000003FF
#define _USBHWVER_VERMINOR_LENGTH                0x0000000A

#define _USBHWVER_VERMAJOR_POSITION              0x0000000A
#define _USBHWVER_VERMAJOR_MASK                  0x00007C00
#define _USBHWVER_VERMAJOR_LENGTH                0x00000005

#define _USBHWVER_RC_POSITION                    0x0000000F
#define _USBHWVER_RC_MASK                        0x00008000
#define _USBHWVER_RC_LENGTH                      0x00000001

#define _USBINFO_TXENDPTS_POSITION               0x00000000
#define _USBINFO_TXENDPTS_MASK                   0x0000000F
#define _USBINFO_TXENDPTS_LENGTH                 0x00000004

#define _USBINFO_RXENDPTS_POSITION               0x00000004
#define _USBINFO_RXENDPTS_MASK                   0x000000F0
#define _USBINFO_RXENDPTS_LENGTH                 0x00000004

#define _USBINFO_RAMBITS_POSITION                0x00000008
#define _USBINFO_RAMBITS_MASK                    0x00000F00
#define _USBINFO_RAMBITS_LENGTH                  0x00000004

#define _USBINFO_DMACHANS_POSITION               0x0000000C
#define _USBINFO_DMACHANS_MASK                   0x0000F000
#define _USBINFO_DMACHANS_LENGTH                 0x00000004

#define _USBINFO_WTID_POSITION                   0x00000010
#define _USBINFO_WTID_MASK                       0x000F0000
#define _USBINFO_WTID_LENGTH                     0x00000004

#define _USBINFO_WTCON_POSITION                  0x00000014
#define _USBINFO_WTCON_MASK                      0x00F00000
#define _USBINFO_WTCON_LENGTH                    0x00000004

#define _USBINFO_VPLEN_POSITION                  0x00000018
#define _USBINFO_VPLEN_MASK                      0xFF000000
#define _USBINFO_VPLEN_LENGTH                    0x00000008

#define _USBEOFRST_HSEOF_POSITION                0x00000000
#define _USBEOFRST_HSEOF_MASK                    0x000000FF
#define _USBEOFRST_HSEOF_LENGTH                  0x00000008

#define _USBEOFRST_FSEOF_POSITION                0x00000008
#define _USBEOFRST_FSEOF_MASK                    0x0000FF00
#define _USBEOFRST_FSEOF_LENGTH                  0x00000008

#define _USBEOFRST_LSEOF_POSITION                0x00000010
#define _USBEOFRST_LSEOF_MASK                    0x00FF0000
#define _USBEOFRST_LSEOF_LENGTH                  0x00000008

#define _USBEOFRST_NRST_POSITION                 0x00000018
#define _USBEOFRST_NRST_MASK                     0x01000000
#define _USBEOFRST_NRST_LENGTH                   0x00000001

#define _USBEOFRST_NRSTX_POSITION                0x00000019
#define _USBEOFRST_NRSTX_MASK                    0x02000000
#define _USBEOFRST_NRSTX_LENGTH                  0x00000001

#define _USBEOFRST_SOFRST_POSITION               0x00000018
#define _USBEOFRST_SOFRST_MASK                   0xFF000000
#define _USBEOFRST_SOFRST_LENGTH                 0x00000008

#define _USBE0TXA_TXFADDR_POSITION               0x00000000
#define _USBE0TXA_TXFADDR_MASK                   0x0000007F
#define _USBE0TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE0TXA_TXHUBADD_POSITION              0x00000010
#define _USBE0TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE0TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE0TXA_MULTTRAN_POSITION              0x00000017
#define _USBE0TXA_MULTTRAN_MASK                  0x00800000
#define _USBE0TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE0TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE0TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE0TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE0RXA_RXHUBADD_POSITION              0x00000010
#define _USBE0RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE0RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE0RXA_MULTTRAN_POSITION              0x00000017
#define _USBE0RXA_MULTTRAN_MASK                  0x00800000
#define _USBE0RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE0RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE0RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE0RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE1TXA_TXFADDR_POSITION               0x00000000
#define _USBE1TXA_TXFADDR_MASK                   0x0000007F
#define _USBE1TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE1TXA_TXHUBADD_POSITION              0x00000010
#define _USBE1TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE1TXA_TXHUBADD_LENGTH                0x00000007

